import re # Імпорт модуля re

text = "Мій номер: 097-123-45-67" # Змінна, яка містить рядок у якому ми будемо здійснювати пошук.
pattern = r"\d{3}-\d{3}-\d{2}-\d{2}" # Змінна, яка містить регулярний вираз

result = re.search(pattern, text) # Змінна, функція якої сканує весь рядок text і шукає перший збіг з pattern

if result: # Перевіряє чи щось знайдено
	print("Знайдено:", result.group()) # Виводить шматок текту, який збігся з шаблоном
else: 
	print("Нічого не знайдено") # Працює у тому випадку, якби у рядку text не було тексту